<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice 4.1.12  (Win32)">
	<META NAME="CREATED" CONTENT="0;0">
	<META NAME="CHANGEDBY" CONTENT="Matteo Gabriele">
	<META NAME="CHANGED" CONTENT="20220530;19174500">
	<META NAME="CHANGEDBY" CONTENT="Matteo Gabriele">
	<META NAME="created" CONTENT="2021-09-11T17:23:06.572014143">
	<META NAME="changed" CONTENT="2022-05-02T14:27:07.201836581">
	<STYLE TYPE="text/css">
	<!--
		@page { size: 21.01cm 29.69cm; margin: 2.01cm }
		P { margin-bottom: 0.25cm; background: transparent }
	-->
	</STYLE>
</HEAD>
<BODY LANG="it-IT" DIR="LTR">
<P ALIGN=CENTER STYLE="margin-top: 0.43cm; margin-bottom: 0.2cm; line-height: 100%; page-break-after: avoid">
<FONT FACE="Liberation Sans, sans-serif"><FONT SIZE=6 STYLE="font-size: 28pt"><B>Sensore</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; line-height: 100%">Per connettere il
sensore il Freestyle Libre 2 tramite il Low Energy Bluetooth, il
Bluetooth deve essere acceso.</P>
<P STYLE="margin-bottom: 0cm; line-height: 100%">Dopo aver
scansionato il sensore con questa app, non succeder&agrave; pi&ugrave;
nulla. Il sensore non comunicher&agrave; pi&ugrave; con il suo reader
o con altre app sullo smartphone. Gli allarmi dell'app Abbott
Librelink devono essere spenti e l'app chiusa. Alcune app Librelink
sembrano comunicare col sensore anche con gli allarmi spenti e questo
pu&ograve; creare problemi di connessione. Usare &ldquo;<I>Termina
forzatamente</I>&rdquo; <SPAN STYLE="font-style: normal">per
interromperla con certezza.</SPAN></P>
<P STYLE="margin-bottom: 0cm; line-height: 100%"><SPAN STYLE="font-style: normal"><B>Sensore
via Bluetooth</B></SPAN> <SPAN STYLE="font-style: normal"><SPAN STYLE="font-weight: normal">deve
essere selezionato.</SPAN></SPAN></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: normal; line-height: 100%">
Se le suddette condizioni sono soddisfatte, pu&ograve; passare un
lungo tempo prima che l'app riceva valori di glucosio dal sensore.
Spesso ci impiega un minuto ma alcune volte ci pu&ograve; volere
molto di pi&ugrave;.</P>
<P STYLE="margin-bottom: 0cm; line-height: 100%"><SPAN LANG="it-IT"><SPAN STYLE="font-style: normal"><SPAN STYLE="font-weight: normal">Il
</SPAN></SPAN></SPAN><SPAN LANG="it-IT"><I><SPAN STYLE="font-weight: normal">Stato
di connessione</SPAN></I></SPAN><SPAN LANG="it-IT"><I><SPAN STYLE="font-weight: normal">
</SPAN></I></SPAN><SPAN LANG="it-IT"><SPAN STYLE="font-style: normal"><SPAN STYLE="font-weight: normal">mostra
I problemi. (Il pi&ugrave; delle volte l'errore pi&ugrave; comune &egrave;
status=133, che &egrave; l'argomento dello stato di
</SPAN></SPAN></SPAN><SPAN LANG="it-IT"><A HREF="https://developer.android.com/reference/android/bluetooth/BluetoothGattCallback#onConnectionStateChange(android.bluetooth.BluetoothGatt,%20int,%20int)">onConnectionStateChange(BluetoothGatt
bluetoothGatt, int status, int newState)</A>). Qualche volta spegnere
e riaccendere il Bluetooth, riavviare il telefono o spegnere il
Bluetooth sugli altri dispositivi pu&ograve; risolvere. Altre volte
il problema pu&ograve; essere risolto scansionando il sensore.</SPAN></P>
<P STYLE="margin-bottom: 0cm; line-height: 100%">Scansionare il
sensore con Juggluco (con <I>Sensore via Bluetooth</I> <SPAN STYLE="font-style: normal">abilitato)
su un altro telefono, ruber&agrave; la connessione al telefono di
partenza. Scansionandolo con questo torner&agrave; a lui. (uno dei
sensori con connessione Bluletooth che ho migrato da un telefono ad
uno smartwatch Wear Os per circa tre volte, ha dato errore di
connessione 133 per 2 giorni e mezzo, riprendendo a funzionare dopo
373 errori registrati).</SPAN></P>
<P STYLE="margin-bottom: 0cm; line-height: 100%"><I>Doze mode</I>
<SPAN STYLE="font-style: normal">apre uno schermo in cui poter
specificare che il risparmio energetico non deve essere applicato a
Juggluco. Questo pu&ograve; esere necessario per permettere il
funzionamento dell'app quando il telefono &egrave; in standby.</SPAN></P>
<P STYLE="margin-bottom: 0cm; line-height: 100%"><I>Permessi</I><SPAN STYLE="font-style: normal">:
la precedente versione di Juggluco necessitava I permessi relativi
alla posizione per cercare l'indirizzo del sensore. Questo non &egrave;
pi&ugrave; necessario. Pu&ograve; essere per&ograve; che ci siano
sensori che lo richiedano, in questo caso devi abilitarlo. Dopo il
primo contatto Juggluco salva l'indirizzo del dispositivo e I
permessi della posizione saranno inutili. L'indirizzo del
dispositivo, se conosciuto, &egrave; mostrato vicino
all'identificatore del sensore. Se rosso significa che &egrave; un
sensore US.</SPAN></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; line-height: 100%">Android
12 ha un nuovo sistema di permessi relativi ai dispositivi nelle
vicinanze che pu&ograve; essere usato al posto dei permessi
precedenti per abilitare la ricerca dell'indirizzo del dispositivo
tramite Bluetooth.</P>
<P STYLE="margin-bottom: 0cm; line-height: 100%"><I>Dimentica</I><SPAN STYLE="font-style: normal">:
dimentica l'indirizzo del dispositivo, che andr&agrave; riabilitato
scansionando il sensore di nuovo. Per far questo serve il permesso
alla posizione sugli </SPAN>Android dal 6 al 11. Su Android 12 serve
invece il permesso Dispositivi Vicini.</P>
<P STYLE="margin-bottom: 0cm; line-height: 100%"><I>Reinit</I>:
Riabilita lo streaming dei valori: Una nuova autenticazione verr&agrave;
creata per comunicare col sensore. Verr&agrave; impostato anche
l'indirizzo del dispositivo.</P>
</BODY>
</HTML>