<!DOCTYPE html>
<html>
<head>
	<meta http-equiv="content-type" content="text/html; charset=windows-1252"/>
	<title></title>
	<meta name="generator" content="LibreOffice 7.3.4.2 (Windows)"/>
	<meta name="created" content="2021-07-02T15:57:22.472063254"/>
	<meta name="changed" content="2023-11-04T12:06:58.672000000"/>
	<style type="text/css">
		@page { size: 21.01cm 29.69cm; margin: 2.01cm }
		p { margin-bottom: 0.25cm; background: transparent }
		h2.cjk { font-family: "Droid Sans Fallback" }
		h2.ctl { font-family: "Droid Sans Devanagari" }
	</style>
</head>
<body lang="en-US" dir="ltr"><h1>A&ntilde;adir conexi&oacute;n</h1>
<p style="line-height: 100%; margin-bottom: 0cm">Especifica una
conexi&oacute;n con otra instancia de Juggluco. El Juggluco de un
dispositivo env&iacute;a datos por IP/TCP al Juggluco de otro
dispositivo. Para establecer una conexi&oacute;n, uno de los Juggluco
tiene que escuchar en un puerto y el otro tiene que establecer
contacto con ese puerto. El puerto en el que esta instancia de
Juggluco est&aacute; escuchando, se dio en la pantalla anterior (Men&uacute;
central izquierdo-&gt; Espejo). Aqu&iacute; se especifica el puerto
al que esta instancia de Juggluco contacta si hace contacto
activamente. Si esta instancia de Juggluco no puede escuchar en un
puerto, selecciona &quot;S&oacute;lo activo&quot;. Si la otra parte
no puede escuchar en un puerto, selecciona &quot;S&oacute;lo pasivo&quot;;
de lo contrario, deja marcada la opci&oacute;n &quot;Ambos&quot;. El
Juggluco del otro lado debe especificar S&oacute;lo pasivo si
seleccionas aqu&iacute; S&oacute;lo activo y S&oacute;lo activo si
seleccionas aqu&iacute; S&oacute;lo pasivo y Ambos si seleccionas
aqu&iacute; Ambos.</p>
<p style="line-height: 100%; margin-bottom: 0cm">Si esta instancia de
Juggluco contacta activamente, debes especificar la(s) IP(s) con
la(s) que debe contactar. Si ese host tiene m&uacute;ltiples IPs,
especifica m&aacute;s de una; por ejemplo cuando dos dispositivos
est&aacute;n conectados a veces a trav&eacute;s de una red dom&eacute;stica
y a veces directamente como hotspot port&aacute;til. Nunca
especifiques las IPs de varios dispositivos, en ese caso cada uno
recibir&aacute; s&oacute;lo una parte de los datos.</p>
<p style="line-height: 100%; margin-bottom: 0cm">En todos los casos
excepto en 'S&oacute;lo activo', puedes seleccionar '<b>Detectar</b>';
en este caso Juggluco guarda la primera IP que contacta con Juggluco
como la IP del otro lado. Verificar si el dispositivo correcto est&aacute;
haciendo contacto puede de dos maneras: Seleccione '<b>Probar IP</b>'
para comprobar la IP. Si selecciona '<b>Probar Etiqueta</b>', s&oacute;lo
se establece contacto si ambos lados han especificado la misma
etiqueta.</p>
<p style="line-height: 100%; margin-bottom: 0cm">Seleccione <b>recibir
de</b><b>sde</b> si desea que esta aplicaci&oacute;n funcione como
aplicaci&oacute;n espejo. <br/>
Si quieres que este dispositivo sea
el <b>emisor</b> de datos, tienes que especificar qu&eacute; datos
enviar.</p>
<p style="line-height: 100%; margin-bottom: 0cm"><b>Cantidades</b>:
dosis, alimentos y datos deportivos que haya especificado.</p>
<p style="line-height: 100%; margin-bottom: 0cm"><b>Escaneos</b>:
datos recibidos al escanear el sensor (escaneos e historial en
Libre2, en Libre3 s&oacute;lo los datos necesarios para acceder al
sensor por Bluetooth).</p>
<p style="line-height: 100%; margin-bottom: 0cm"><b>Tendencia</b><b>:</b>
los datos recibidos por Bluetooth. En Libre3 esto incluye los datos
del historial.</p>
<p style="line-height: 100%; margin-bottom: 0cm">A veces algunos
datos ya est&aacute;n presentes en el dispositivo receptor. Puede
especificar hasta cu&aacute;ndo est&aacute;n presentes estos datos:</p>
<p style="line-height: 100%; margin-bottom: 0cm"><i>Inicio:</i> no
hay datos<br/>
<i>Ahora</i>: todos los datos presentes</p>
<p style="line-height: 100%; margin-bottom: 0cm">O una fecha
espec&iacute;fica determinada por la posici&oacute;n de inicio de la
pantalla.</p>
<p style="line-height: 100%; margin-bottom: 0cm">Cuando se a&ntilde;ade
una fuente de datos a una conexi&oacute;n existente, la fecha de
inicio s&oacute;lo determina la fuente de datos a&ntilde;adida. Por
ejemplo, si ya se enviaban escaneos y flujos al host y ahora se
a&ntilde;aden importes, la fecha de inicio s&oacute;lo determina el
env&iacute;o de importes.</p>
<p style="line-height: 100%; margin-bottom: 0cm">En caso de que dos
dispositivos est&eacute;n conectados a trav&eacute;s de una conexi&oacute;n
insegura, los datos se pueden firmar y cifrar especificando la misma
<b>contrase&ntilde;a</b> (m&aacute;xima) de 16 caracteres en ambos
lados de la conexi&oacute;n. Seleccione <b>Guardar</b> para guardar
lo especificado. <b>Borrar</b> eliminar&aacute; esta especificaci&oacute;n
de conexi&oacute;n.</p>
<p style="line-height: 100%; margin-bottom: 0cm">En la situaci&oacute;n
m&aacute;s sencilla, todas las conexiones pertenecen a tu red
dom&eacute;stica, por lo que puedes utilizar IPs locales. Tambi&eacute;n
puede conectarse a Internet a trav&eacute;s de Wi-Fi, en cuyo caso
debe consultar el manual de su m&oacute;dem para saber c&oacute;mo
redirigir un puerto externo a una IP y un puerto de su red dom&eacute;stica.</p>
<p style="line-height: 100%; margin-bottom: 0cm">Dos smartphones
conectados mediante una conexi&oacute;n de datos m&oacute;viles a
trav&eacute;s de Internet pueden conectarse directamente entre s&iacute;,
si uno de ellos puede escuchar en un puerto de red. Si ambos no
pueden (por ejemplo, si ninguno tiene una IP individual), a&uacute;n
pueden comunicarse entre s&iacute; a trav&eacute;s de un tercer
dispositivo. Una posibilidad es ejecutar Juggluco en un dispositivo
Android (Android 4.4 como m&iacute;nimo) en casa conectado a Internet
a trav&eacute;s de un m&oacute;dem. Otra posibilidad es ejecutar un
programa de l&iacute;nea de comandos perteneciente a Juggluco en un
ordenador (por ejemplo, tu PC o Amazon AWS):</p>
<p style="line-height: 100%; margin-bottom: 0cm"><a href="https://www.juggluco.nl/Juggluco/cmdline/index.html">https://www.juggluco.nl/Juggluco/cmdline/index.html</a></p>
<p style="line-height: 100%; margin-bottom: 0cm">Tutoriales de
reenv&iacute;o de puertos:</p>
<p style="line-height: 100%; margin-bottom: 0cm"><a href="https://portforward.com/how-to-port-forward/">https://portforward.com/how-to-port-forward/</a></p>
<p style="line-height: 100%; margin-bottom: 0cm"><a href="https://stevessmarthomeguide.com/understanding-port-forwarding/">https://stevessmarthomeguide.com/understanding-port-forwarding/</a></p>
<p style="line-height: 100%; margin-bottom: 0cm">Es posible recibir
valores de glucosa a trav&eacute;s de Bluetooth en un dispositivo sin
NFC (consulte https://www.juggluco.nl/Juggluco/mirror): Inicialice el
sensor a trav&eacute;s de NFC en el dispositivo NFC y, a
continuaci&oacute;n, env&iacute;e los datos de escaneo y transmisi&oacute;n
al dispositivo sin NFC. A continuaci&oacute;n, invierta la conexi&oacute;n
para la fecha de transmisi&oacute;n y desactive la conexi&oacute;n
Bluetooth en el dispositivo NFC y act&iacute;vela en el dispositivo
sin NFC, y desactive tambi&eacute;n el &quot;sensor a trav&eacute;s
de Bluetooth&quot; en el dispositivo NFC y act&iacute;velo en el
dispositivo sin NFC. As&iacute; podr&aacute;s escanear con un
dispositivo y obtener los valores de glucosa v&iacute;a Bluetooth en
otro dispositivo. Pero en todos los dispositivos deben estar
disponibles todos los datos del sensor. Si los dispositivos
intercambian datos, siempre deben recibir tanto los datos de escaneo
como los de flujo. Por lo tanto, siempre debe enviar los datos Stream
al dispositivo NFC y los datos de escaneo al dispositivo no NFC. De
lo contrario, los datos se desincronizar&aacute;n, lo que provocar&aacute;
que se utilicen datos de autenticaci&oacute;n antiguos o que los
datos nuevos se sobrescriban con datos antiguos.<br/>
Los datos de
Cantidades son totalmente independientes.</p>
<h2 class="western">Problemas de red</h2>
<p>Es necesaria una estricta especificaci&oacute;n complementaria a
ambos lados de la conexi&oacute;n. Una simple omisi&oacute;n puede
hacer imposible la transmisi&oacute;n de datos.</p>
<p>Es posible que la conexi&oacute;n se cuelgue y haya que
restablecerla activando o desactivando WIFI o pulsando Sync. Tambi&eacute;n
puede cambiar una conexi&oacute;n activa-pasiva a ambas o al rev&eacute;s.</p>
<p>Tambi&eacute;n deber&iacute;as considerar el cambio de IPs con el
cambio de conexi&oacute;n. Por ejemplo, hay que utilizar IP
diferentes en la red dom&eacute;stica que en un punto de acceso
port&aacute;til.</p>
<p><br/>
<br/>

</p>
</body>
</html>